{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.4.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 320, 320, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 320, 320, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "data"}, "name": "data", "inbound_nodes": []}, {"class_name": "BatchNormalization", "config": {"name": "bn_data", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn_data", "inbound_nodes": [[["data", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "name": "zero_padding2d", "inbound_nodes": [[["bn_data", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv0", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv0", "inbound_nodes": [[["zero_padding2d", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn0", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn0", "inbound_nodes": [[["conv0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu0", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu0", "inbound_nodes": [[["bn0", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_1", "inbound_nodes": [[["relu0", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "pooling0", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "pooling0", "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_unit1_bn1", "inbound_nodes": [[["pooling0", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_unit1_relu1", "inbound_nodes": [[["stage1_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_2", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit1_conv1", "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_unit1_bn2", "inbound_nodes": [[["stage1_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_unit1_relu2", "inbound_nodes": [[["stage1_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_3", "inbound_nodes": [[["stage1_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit1_conv2", "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit1_sc", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit1_sc", "inbound_nodes": [[["stage1_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add", "trainable": true, "dtype": "float32"}, "name": "add", "inbound_nodes": [[["stage1_unit1_conv2", 0, 0, {}], ["stage1_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_unit2_bn1", "inbound_nodes": [[["add", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_unit2_relu1", "inbound_nodes": [[["stage1_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_4", "inbound_nodes": [[["stage1_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit2_conv1", "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage1_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage1_unit2_bn2", "inbound_nodes": [[["stage1_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage1_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage1_unit2_relu2", "inbound_nodes": [[["stage1_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_5", "inbound_nodes": [[["stage1_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage1_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage1_unit2_conv2", "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_1", "trainable": true, "dtype": "float32"}, "name": "add_1", "inbound_nodes": [[["stage1_unit2_conv2", 0, 0, {}], ["add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit1_bn1", "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit1_relu1", "inbound_nodes": [[["stage2_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_6", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_6", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit1_conv1", "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit1_bn2", "inbound_nodes": [[["stage2_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit1_relu2", "inbound_nodes": [[["stage2_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_7", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_7", "inbound_nodes": [[["stage2_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit1_conv2", "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit1_sc", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit1_sc", "inbound_nodes": [[["stage2_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_2", "trainable": true, "dtype": "float32"}, "name": "add_2", "inbound_nodes": [[["stage2_unit1_conv2", 0, 0, {}], ["stage2_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit2_bn1", "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit2_relu1", "inbound_nodes": [[["stage2_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_8", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_8", "inbound_nodes": [[["stage2_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit2_conv1", "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage2_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage2_unit2_bn2", "inbound_nodes": [[["stage2_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage2_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage2_unit2_relu2", "inbound_nodes": [[["stage2_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_9", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_9", "inbound_nodes": [[["stage2_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage2_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage2_unit2_conv2", "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_3", "trainable": true, "dtype": "float32"}, "name": "add_3", "inbound_nodes": [[["stage2_unit2_conv2", 0, 0, {}], ["add_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit1_bn1", "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit1_relu1", "inbound_nodes": [[["stage3_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_10", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_10", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit1_conv1", "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit1_bn2", "inbound_nodes": [[["stage3_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit1_relu2", "inbound_nodes": [[["stage3_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_11", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_11", "inbound_nodes": [[["stage3_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit1_conv2", "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit1_sc", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit1_sc", "inbound_nodes": [[["stage3_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_4", "trainable": true, "dtype": "float32"}, "name": "add_4", "inbound_nodes": [[["stage3_unit1_conv2", 0, 0, {}], ["stage3_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit2_bn1", "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit2_relu1", "inbound_nodes": [[["stage3_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_12", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_12", "inbound_nodes": [[["stage3_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit2_conv1", "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage3_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage3_unit2_bn2", "inbound_nodes": [[["stage3_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage3_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage3_unit2_relu2", "inbound_nodes": [[["stage3_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_13", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_13", "inbound_nodes": [[["stage3_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage3_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage3_unit2_conv2", "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_5", "trainable": true, "dtype": "float32"}, "name": "add_5", "inbound_nodes": [[["stage3_unit2_conv2", 0, 0, {}], ["add_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage4_unit1_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage4_unit1_bn1", "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage4_unit1_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage4_unit1_relu1", "inbound_nodes": [[["stage4_unit1_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_14", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_14", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage4_unit1_conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage4_unit1_conv1", "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage4_unit1_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage4_unit1_bn2", "inbound_nodes": [[["stage4_unit1_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage4_unit1_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage4_unit1_relu2", "inbound_nodes": [[["stage4_unit1_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_15", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_15", "inbound_nodes": [[["stage4_unit1_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage4_unit1_conv2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage4_unit1_conv2", "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage4_unit1_sc", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage4_unit1_sc", "inbound_nodes": [[["stage4_unit1_relu1", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_6", "trainable": true, "dtype": "float32"}, "name": "add_6", "inbound_nodes": [[["stage4_unit1_conv2", 0, 0, {}], ["stage4_unit1_sc", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage4_unit2_bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage4_unit2_bn1", "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage4_unit2_relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage4_unit2_relu1", "inbound_nodes": [[["stage4_unit2_bn1", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_16", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_16", "inbound_nodes": [[["stage4_unit2_relu1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage4_unit2_conv1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage4_unit2_conv1", "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "stage4_unit2_bn2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "stage4_unit2_bn2", "inbound_nodes": [[["stage4_unit2_conv1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "stage4_unit2_relu2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "stage4_unit2_relu2", "inbound_nodes": [[["stage4_unit2_bn2", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_17", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "zero_padding2d_17", "inbound_nodes": [[["stage4_unit2_relu2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "stage4_unit2_conv2", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "HeUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "stage4_unit2_conv2", "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "add_7", "trainable": true, "dtype": "float32"}, "name": "add_7", "inbound_nodes": [[["stage4_unit2_conv2", 0, 0, {}], ["add_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "bn1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 2e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn1", "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu1", "inbound_nodes": [[["bn1", 0, 0, {}]]]}], "input_layers": [["data", 0, 0]], "output_layers": [["relu1", 0, 0]]}, "name": "model", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["model", 1, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "global_average_pooling2d", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["global_average_pooling2d", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy", {"class_name": "AUC", "config": {"name": "auc", "dtype": "float32", "num_thresholds": 200, "curve": "ROC", "summation_method": "interpolation", "thresholds": [0.005025125628140704, 0.010050251256281407, 0.01507537688442211, 0.020100502512562814, 0.02512562814070352, 0.03015075376884422, 0.035175879396984924, 0.04020100502512563, 0.04522613065326633, 0.05025125628140704, 0.05527638190954774, 0.06030150753768844, 0.06532663316582915, 0.07035175879396985, 0.07537688442211055, 0.08040201005025126, 0.08542713567839195, 0.09045226130653267, 0.09547738693467336, 0.10050251256281408, 0.10552763819095477, 0.11055276381909548, 0.11557788944723618, 0.12060301507537688, 0.12562814070351758, 0.1306532663316583, 0.135678391959799, 0.1407035175879397, 0.1457286432160804, 0.1507537688442211, 0.15577889447236182, 0.16080402010050251, 0.1658291457286432, 0.1708542713567839, 0.17587939698492464, 0.18090452261306533, 0.18592964824120603, 0.19095477386934673, 0.19597989949748743, 0.20100502512562815, 0.20603015075376885, 0.21105527638190955, 0.21608040201005024, 0.22110552763819097, 0.22613065326633167, 0.23115577889447236, 0.23618090452261306, 0.24120603015075376, 0.24623115577889448, 0.25125628140703515, 0.2562814070351759, 0.2613065326633166, 0.2663316582914573, 0.271356783919598, 0.27638190954773867, 0.2814070351758794, 0.2864321608040201, 0.2914572864321608, 0.2964824120603015, 0.3015075376884422, 0.3065326633165829, 0.31155778894472363, 0.3165829145728643, 0.32160804020100503, 0.32663316582914576, 0.3316582914572864, 0.33668341708542715, 0.3417085427135678, 0.34673366834170855, 0.35175879396984927, 0.35678391959798994, 0.36180904522613067, 0.36683417085427134, 0.37185929648241206, 0.3768844221105528, 0.38190954773869346, 0.3869346733668342, 0.39195979899497485, 0.3969849246231156, 0.4020100502512563, 0.40703517587939697, 0.4120603015075377, 0.41708542713567837, 0.4221105527638191, 0.4271356783919598, 0.4321608040201005, 0.4371859296482412, 0.44221105527638194, 0.4472361809045226, 0.45226130653266333, 0.457286432160804, 0.4623115577889447, 0.46733668341708545, 0.4723618090452261, 0.47738693467336685, 0.4824120603015075, 0.48743718592964824, 0.49246231155778897, 0.49748743718592964, 0.5025125628140703, 0.507537688442211, 0.5125628140703518, 0.5175879396984925, 0.5226130653266332, 0.5276381909547738, 0.5326633165829145, 0.5376884422110553, 0.542713567839196, 0.5477386934673367, 0.5527638190954773, 0.5577889447236181, 0.5628140703517588, 0.5678391959798995, 0.5728643216080402, 0.5778894472361809, 0.5829145728643216, 0.5879396984924623, 0.592964824120603, 0.5979899497487438, 0.6030150753768844, 0.6080402010050251, 0.6130653266331658, 0.6180904522613065, 0.6231155778894473, 0.628140703517588, 0.6331658291457286, 0.6381909547738693, 0.6432160804020101, 0.6482412060301508, 0.6532663316582915, 0.6582914572864321, 0.6633165829145728, 0.6683417085427136, 0.6733668341708543, 0.678391959798995, 0.6834170854271356, 0.6884422110552764, 0.6934673366834171, 0.6984924623115578, 0.7035175879396985, 0.7085427135678392, 0.7135678391959799, 0.7185929648241206, 0.7236180904522613, 0.7286432160804021, 0.7336683417085427, 0.7386934673366834, 0.7437185929648241, 0.7487437185929648, 0.7537688442211056, 0.7587939698492462, 0.7638190954773869, 0.7688442211055276, 0.7738693467336684, 0.7788944723618091, 0.7839195979899497, 0.7889447236180904, 0.7939698492462312, 0.7989949748743719, 0.8040201005025126, 0.8090452261306532, 0.8140703517587939, 0.8190954773869347, 0.8241206030150754, 0.8291457286432161, 0.8341708542713567, 0.8391959798994975, 0.8442211055276382, 0.8492462311557789, 0.8542713567839196, 0.8592964824120602, 0.864321608040201, 0.8693467336683417, 0.8743718592964824, 0.8793969849246231, 0.8844221105527639, 0.8894472361809045, 0.8944723618090452, 0.8994974874371859, 0.9045226130653267, 0.9095477386934674, 0.914572864321608, 0.9195979899497487, 0.9246231155778895, 0.9296482412060302, 0.9346733668341709, 0.9396984924623115, 0.9447236180904522, 0.949748743718593, 0.9547738693467337, 0.9597989949748744, 0.964824120603015, 0.9698492462311558, 0.9748743718592965, 0.9798994974874372, 0.9849246231155779, 0.9899497487437185, 0.9949748743718593], "multi_label": false, "label_weights": null}}, {"class_name": "Addons>F1Score", "config": {"name": "f1_score", "dtype": "float32", "num_classes": 4, "average": null, "threshold": null}}], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.01, "decay": 0.0, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of11.bin", "group1-shard2of11.bin", "group1-shard3of11.bin", "group1-shard4of11.bin", "group1-shard5of11.bin", "group1-shard6of11.bin", "group1-shard7of11.bin", "group1-shard8of11.bin", "group1-shard9of11.bin", "group1-shard10of11.bin", "group1-shard11of11.bin"], "weights": [{"name": "dense/kernel", "shape": [512, 4], "dtype": "float32"}, {"name": "dense/bias", "shape": [4], "dtype": "float32"}, {"name": "bn_data/beta", "shape": [3], "dtype": "float32"}, {"name": "conv0/kernel", "shape": [7, 7, 3, 64], "dtype": "float32"}, {"name": "bn0/gamma", "shape": [64], "dtype": "float32"}, {"name": "bn0/beta", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit1_bn1/gamma", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit1_bn1/beta", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit1_conv1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "stage1_unit1_bn2/gamma", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit1_bn2/beta", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit1_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "stage1_unit1_sc/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "stage1_unit2_bn1/gamma", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit2_bn1/beta", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit2_conv1/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "stage1_unit2_bn2/gamma", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit2_bn2/beta", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit2_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "stage2_unit1_bn1/gamma", "shape": [64], "dtype": "float32"}, {"name": "stage2_unit1_bn1/beta", "shape": [64], "dtype": "float32"}, {"name": "stage2_unit1_conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "stage2_unit1_bn2/gamma", "shape": [128], "dtype": "float32"}, {"name": "stage2_unit1_bn2/beta", "shape": [128], "dtype": "float32"}, {"name": "stage2_unit1_conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "stage2_unit1_sc/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "stage2_unit2_bn1/gamma", "shape": [128], "dtype": "float32"}, {"name": "stage2_unit2_bn1/beta", "shape": [128], "dtype": "float32"}, {"name": "stage2_unit2_conv1/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "stage2_unit2_bn2/gamma", "shape": [128], "dtype": "float32"}, {"name": "stage2_unit2_bn2/beta", "shape": [128], "dtype": "float32"}, {"name": "stage2_unit2_conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "stage3_unit1_bn1/gamma", "shape": [128], "dtype": "float32"}, {"name": "stage3_unit1_bn1/beta", "shape": [128], "dtype": "float32"}, {"name": "stage3_unit1_conv1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "stage3_unit1_bn2/gamma", "shape": [256], "dtype": "float32"}, {"name": "stage3_unit1_bn2/beta", "shape": [256], "dtype": "float32"}, {"name": "stage3_unit1_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "stage3_unit1_sc/kernel", "shape": [1, 1, 128, 256], "dtype": "float32"}, {"name": "stage3_unit2_bn1/gamma", "shape": [256], "dtype": "float32"}, {"name": "stage3_unit2_bn1/beta", "shape": [256], "dtype": "float32"}, {"name": "stage3_unit2_conv1/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "stage3_unit2_bn2/gamma", "shape": [256], "dtype": "float32"}, {"name": "stage3_unit2_bn2/beta", "shape": [256], "dtype": "float32"}, {"name": "stage3_unit2_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "stage4_unit1_bn1/gamma", "shape": [256], "dtype": "float32"}, {"name": "stage4_unit1_bn1/beta", "shape": [256], "dtype": "float32"}, {"name": "stage4_unit1_conv1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "stage4_unit1_bn2/gamma", "shape": [512], "dtype": "float32"}, {"name": "stage4_unit1_bn2/beta", "shape": [512], "dtype": "float32"}, {"name": "stage4_unit1_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "stage4_unit1_sc/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "stage4_unit2_bn1/gamma", "shape": [512], "dtype": "float32"}, {"name": "stage4_unit2_bn1/beta", "shape": [512], "dtype": "float32"}, {"name": "stage4_unit2_conv1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "stage4_unit2_bn2/gamma", "shape": [512], "dtype": "float32"}, {"name": "stage4_unit2_bn2/beta", "shape": [512], "dtype": "float32"}, {"name": "stage4_unit2_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "bn1/gamma", "shape": [512], "dtype": "float32"}, {"name": "bn1/beta", "shape": [512], "dtype": "float32"}, {"name": "bn_data/moving_mean", "shape": [3], "dtype": "float32"}, {"name": "bn_data/moving_variance", "shape": [3], "dtype": "float32"}, {"name": "bn0/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bn0/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit1_bn1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit1_bn1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit1_bn2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit1_bn2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit2_bn1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit2_bn1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit2_bn2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "stage1_unit2_bn2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "stage2_unit1_bn1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "stage2_unit1_bn1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "stage2_unit1_bn2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "stage2_unit1_bn2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "stage2_unit2_bn1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "stage2_unit2_bn1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "stage2_unit2_bn2/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "stage2_unit2_bn2/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "stage3_unit1_bn1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "stage3_unit1_bn1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "stage3_unit1_bn2/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "stage3_unit1_bn2/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "stage3_unit2_bn1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "stage3_unit2_bn1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "stage3_unit2_bn2/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "stage3_unit2_bn2/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "stage4_unit1_bn1/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "stage4_unit1_bn1/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "stage4_unit1_bn2/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "stage4_unit1_bn2/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "stage4_unit2_bn1/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "stage4_unit2_bn1/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "stage4_unit2_bn2/moving_mean", "shape": 